RT-Thread/rt-thread/bsp/nrf52840/nRF5_SDK_15.3.0_59ac3456/modules/nrfx/hal/nrf_nfct.h
#if defined (NFCT_AUTOCOLRESCONFIG_MODE_Msk) || defined(__NRFX_DOXYGEN__)
/**
 * @brief Function for getting the setting for the automatic collision resolution.
 *
 * @details The automatic collision resolution mechanism as defined in ISO 14443-3 and NFC Forum
 *          Digital Protocol Technical Specification 2.0, section 6.
 *
 * @retval true  If automatic collision resolution is enabled.
 * @retval false If automatic collision resolution is disabled.
 */
__STATIC_INLINE bool nrf_nfct_autocolres_is_enabled(void);

/**
 * @brief Function for enabling the automatic collision resolution.
 *
 * @details The automatic collision resolution mechanism as defined in ISO 14443-3 and NFC Forum
 *          Digital Protocol Technical Specification 2.0, section 6.
 */
__STATIC_INLINE void nrf_nfct_autocolres_enable(void);

/**
 * @brief Function for disabling the automatic collision resolution.
 *
 * @details The automatic collision resolution mechanism as defined in ISO 14443-3 and NFC Forum
 *          Digital Protocol Technical Specification 2.0, section 6.
 */
__STATIC_INLINE void nrf_nfct_autocolres_disable(void);
#endif // defined (NFCT_AUTOCOLRESCONFIG_MODE_Msk) || defined(__NRFX_DOXYGEN__)

/**
 * @brief Function for getting the NFCID1 size from the SENS_RES frame configuration.
 *
 * @details The SENS_RES frame is handled automatically by the NFCT hardware.
 *
 * @return NFCID1 (tag identifier) size.
 */
__STATIC_INLINE nrf_nfct_sensres_nfcid1_size_t nrf_nfct_sensres_nfcid1_size_get(void);

/**
 * @brief Function for setting the NFCID1 (tag identifier) size.field in the SENS_RES frame
 *        configuration.
 *
 * @note The SENS_RES frame is handled automatically by the NFCT hardware.
 *
 * @param[in] nfcid1_size NFCID1 (tag identifier) size.
 *
 * @sa nrf_nfct_nfcid1_set()
 */
__STATIC_INLINE void nrf_nfct_sensres_nfcid1_size_set(nrf_nfct_sensres_nfcid1_size_t nfcid1_size);

/**
 * @brief Function for getting the Bit Frame SDD field from the SENS_RES frame configuration.
 *
 * @details The SENS_RES frame is handled automatically by the NFCT hardware.
 *
 * @return The Bit Frame SDD field configuration.
 */
__STATIC_INLINE nrf_nfct_sensres_bit_frame_sdd_t nrf_nfct_sensres_bit_frame_sdd_get(void);

/**
 * @brief Function for setting the Bit Frame SDD field in the SENS_RES frame configuration.
 *
 * @note The SENS_RES frame is handled automatically by the NFCT hardware.
 *
 * @param[in] bit_frame_sdd The Bit Frame SDD field configuration.
 */
__STATIC_INLINE void nrf_nfct_sensres_bit_frame_sdd_set(nrf_nfct_sensres_bit_frame_sdd_t bit_frame_sdd);

/**
 * @brief Function for getting the Platform Config field from the SENS_RES frame configuration.
 *
 * @details The SENS_RES frame is handled automatically by the NFCT hardware.
 *
 * @return The Platform Config field configuration.
 */
__STATIC_INLINE nrf_nfct_sensres_platform_config_t nrf_nfct_sensres_platform_config_get(void);

/**
 * @brief Function for setting the Platform Config field in the SENS_RES frame configuration.
 *
 * @note The SENS_RES frame is handled automatically by the NFCT hardware.
 *
 * @param[in] platform_config The Platform Config field configuration.
 */
__STATIC_INLINE void nrf_nfct_sensres_platform_config_set(nrf_nfct_sensres_platform_config_t platform_config);

/**
 * @brief Function for checking the CASCADE bit of the SEL_RES frame.
 *
 * @details The CASCADE bit in the SEL_RES register is handled automatically by the NFCT hardware
 *          and indicates the status of the NFCID1 read operation to the NFC poller according to
 *          the NFC Forum Digital Protocol Speficiation 2.0, section 6.8.2.
 *
 * @retval true  If NFCID1 read procedure is not complete.
 * @retval false If NFCID1 read procedure is complete.
 */
__STATIC_INLINE bool nrf_nfct_selsres_cascade_check(void);

/**
 * @brief Function for getting the Protocol field in the SEL_RES frame.
 *
 * @details The SEL_RES frame is handled automatically by the NFCT hardware.
 *
 * @return Value of the Protocol field in the SEL_RES frame.
 */
__STATIC_INLINE nrf_nfct_selres_protocol_t nrf_nfct_selsres_protocol_get(void);

/**
 * @brief Function for setting the Protocol field in the SEL_RES frame configuration.
 *
 * @details The SEL_RES frame is handled automatically by the NFCT hardware.
 *
 * @param[in] sel_res_protocol Value of the Protocol field in the SEL_RES frame.
 */
__STATIC_INLINE void nrf_nfct_selres_protocol_set(nrf_nfct_selres_protocol_t sel_res_protocol);

#ifndef SUPPRESS_INLINE_IMPLEMENTATION
__STATIC_INLINE void nrf_nfct_task_trigger(nrf_nfct_task_t task)
{
    *((volatile uint32_t *)((uint8_t *)NRF_NFCT + (uint32_t)task)) = 1UL;
}

__STATIC_INLINE uint32_t nrf_nfct_task_address_get(nrf_nfct_task_t task)
{
    return (uint32_t)((uint8_t *)NRF_NFCT + (uint32_t)task);
}

__STATIC_INLINE void nrf_nfct_event_clear(nrf_nfct_event_t event)
{
    *((volatile uint32_t *)((uint8_t *)NRF_NFCT + (uint32_t)event)) = 0UL;
    __DSB();
}

__STATIC_INLINE bool nrf_nfct_event_check(nrf_nfct_event_t event)
{
    return (bool)*(volatile const uint32_t *)((uint8_t *)NRF_NFCT + (uint32_t)event);
}

__STATIC_INLINE uint32_t nrf_nfct_event_address_get(nrf_nfct_event_t event)
{
    return (uint32_t)((uint8_t *)NRF_NFCT + (uint32_t)event);
}

__STATIC_INLINE void nrf_nfct_shorts_enable(uint32_t short_mask)
{
    NRF_NFCT->SHORTS |= short_mask;
}

__STATIC_INLINE void nrf_nfct_shorts_disable(uint32_t short_mask)
{
    NRF_NFCT->SHORTS &= ~short_mask;
}

__STATIC_INLINE uint32_t nrf_nfct_shorts_get(void)
{
    return NRF_NFCT->SHORTS;
}

__STATIC_INLINE void nrf_nfct_shorts_set(uint32_t short_mask)
{
    NRF_NFCT->SHORTS = short_mask;
}

__STATIC_INLINE void nrf_nfct_int_enable(uint32_t int_mask)
{
    NRF_NFCT->INTENSET = int_mask;
}

__STATIC_INLINE bool nrf_nfct_int_enable_check(uint32_t int_mask)
{
    return (bool)(NRF_NFCT->INTENSET & int_mask);
}

__STATIC_INLINE uint32_t nrf_nfct_int_enable_get(void)
{
    return NRF_NFCT->INTENSET;
}

__STATIC_INLINE void nrf_nfct_int_disable(uint32_t int_mask)
{
    NRF_NFCT->INTENCLR = int_mask;
}

__STATIC_INLINE uint32_t nrf_nfct_error_status_get(void)
{
    return NRF_NFCT->ERRORSTATUS;
}

__STATIC_INLINE void nrf_nfct_error_status_clear(uint32_t error_flags)
{
    NRF_NFCT->ERRORSTATUS = error_flags;
}

__STATIC_INLINE uint32_t nrf_nfct_rx_frame_status_get(void)
{
    return NRF_NFCT->FRAMESTATUS.RX;
}

__STATIC_INLINE void nrf_nfct_rx_frame_status_clear(uint32_t framestatus_flags)
{
    NRF_NFCT->FRAMESTATUS.RX = framestatus_flags;
}

#if defined(NFCT_NFCTAGSTATE_NFCTAGSTATE_Msk) || defined(__NRFX_DOXYGEN__)
__STATIC_INLINE nrf_nfct_tag_state_t nrf_nfct_tag_state_get(void)
{
    return (nrf_nfct_tag_state_t)((NRF_NFCT->NFCTAGSTATE & NFCT_NFCTAGSTATE_NFCTAGSTATE_Msk) >>
                                  NFCT_NFCTAGSTATE_NFCTAGSTATE_Pos);
}
#endif // defined(NFCT_NFCTAGSTATE_NFCTAGSTATE_Msk) || defined(__NRFX_DOXYGEN__)

#if defined (NFCT_SLEEPSTATE_SLEEPSTATE_Msk) || defined(__NRFX_DOXYGEN__)
__STATIC_INLINE nrf_nfct_sleep_state_t nrf_nfct_sleep_state_get(void)
{
    return (nrf_nfct_sleep_state_t)((NRF_NFCT->SLEEPSTATE & NFCT_SLEEPSTATE_SLEEPSTATE_Msk) >>
                                    NFCT_SLEEPSTATE_SLEEPSTATE_Pos);
}
#endif // defined (NFCT_SLEEPSTATE_SLEEPSTATE_Msk) || defined(__NRFX_DOXYGEN__)

__STATIC_INLINE uint8_t nrf_nfct_field_status_get(void)
{
    return (uint8_t)(NRF_NFCT->FIELDPRESENT);
}

__STATIC_INLINE uint16_t nrf_nfct_frame_delay_min_get(void)
{
    return (uint16_t)((NRF_NFCT->FRAMEDELAYMIN & NFCT_FRAMEDELAYMIN_FRAMEDELAYMIN_Msk) >>
                      NFCT_FRAMEDELAYMIN_FRAMEDELAYMIN_Pos);
}

